export interface PoetType {
  id: number;
  title: string;
  image: string;
  text: string;
}

export const POET_DATA: PoetType[] = [
  {
    id: 1,
    title: "بدر الدين الحامد",
    image:
      "http://fedaa.alwehda.gov.sy/wp-content/uploads//2020/07/images_2020_07_2-7-2020_82988759_1950604355239051_7879981848851986040_n_137ad.png",
    text: "الشاعر بدر الدين بن محمود الحامد: (1897 م - 1961 م) الموافق: (1315هـ - 1381هـ) من مواليد مدينة حماة السورية, وهو أخو العالم الفضيل الشيخ محمد الحامد أبرز علماء بلاد الشام. قرض الشعر وهو فتى ولقب بشاعر العاصي. شاعر ومناضل وطني، ولد في مدينة حماة السورية، وقضى حياته فيها. ترعرع في أسرة محافظة يغمرها العلم ويفيض منها الشعر والأدب، فأبوه وأخواله وإخوته كلهم أدباء، وكلهم من العلماء في مدينة حماة، فنشأ متأثراً بهذا المناخ. درس على يد أبيه العلوم الدينية والقرآن الكريم واللغة العربية، وبعد أن أنهى دراسته الثانوية انتقل إلى دار المعلمين ونال أهلية التعليم الابتدائي عام 1923، ثم تخرج من الكلية الصلاحية بالقدس، أمضى الشاعر بدر الدين الحامد حياته متنقلاً بين التدريس والعمل الإداري، فبعد أن درّس اللغة العربية وآدابها في مدارس حمص وحماة أكثر من ستة وعشرين عاماً، عين عام 1946 مفتشاً للمعارف في حماة، ثم مديراً للتربية فيها.كما كان له نشاط اجتماعي، فقد كان عضواً في الرابطة الثقافية التي ضمت خريجي الكلية الصلاحية.",
  },
  {
    id: 2,
    title: "خليل مطران",
    image: "https://alketaba.com/wp-content/uploads/2020/12/unnamed.jpg",
    text: "خليل مطران (شاعر القطرين) (1 يوليو 1872 - 1 يونيو 1949) شاعر لبناني شهير عاش معظم حياته في مصر. عرف بغوصه في المعاني وجمعه بين الثقافة العربية والأجنبية، كما كان من كبار الكتاب عمل بالتاريخ والترجمة، يشبّه بالأخطل بين حافظ وشوقي، كما شبهه المنفلوطي بابن الرومي. عرف مطران بغزارة علمه وإلمامه بالأدب الفرنسي والعربي، هذا بالإضافة لرقة طبعه ومسالمته وهو الشيء الذي انعكس على أشعاره، أُطلق عليه لقب شاعر القطرين ويقصد بهما مصر ولبنان، وبعد وفاة حافظ وشوقي أطلقوا عليه لقب (شاعر الأقطار العربية) دعا مطران إلى التجديد في الأدب والشعر العربي فكان أحد الرواد الذين اخرجوا الشعر العربي من أغراضه التقليدية والبدوية إلى أغراض حديثة تتناسب مع العصر، مع الحفاظ على أصول اللغة والتعبير، كما ادخل الشعر القصصي والتصويري للأدب العربي.",
  },
  {
    id: 3,
    title: "شفيق جبري",
    image:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRlupD5OXchfE2FeTJ3fJE11h_wZ8zpnGDpjQ&s",
    text: "هو أشهر أدباء سوريا وشعرائها الأعلام، وعضو المجمع العلمي العربي بدمشق، وعميد كلية الآداب في الجامعة السورية، والده درويش ابن محمد جبري، وأصل الأسرة شامي منذ عهد قديم، ولد بدمشق سنة 1898م بحي الشاغور، درس العلوم الابتدائية والثانوية في مدرسة الآباء العازاريين بدمشق، وتبحر فـي العلوم على نفسه ولم يفلت من يده كتاب علمي وأدبي إلا طالعه. رحلاته: قام برحلات إلى البلاد الغربية والعربية للاستطلاع وإلى الولايات المتحدة مرتين الأولى بدعوة من الحكومة سنة 1954م والثانية موفداً من قبل الجامعة السورية وكان موضع حفاوة الأوساط العلمية والوجه السوري البارز الذي رفع شأن بلاده بما يتحلى به من سمو المواهب. مؤلفـاتـه: أخـرج إلـى ميـدان الأدب: 1 ـ (الجـاحـظ). 2 ـو(المتنبـي). 3 ـ و(دراسات في الأغاني). 4 ـ و(بين البحر والصحراء). 5 ـ والعناصر النفسية في سياسة العرب، وهي مطبوعة، ومؤلفاته مخطوطة قيد الطبع، وله ديوان شعريمخطوط، وقد وضع مذكراته عن رحلته إلى الولايات المتحدة.",
  },
  {
    id: 4,
    title: "خير الدين الزركلي",
    image: "https://www.arraee.net/wp-content/uploads/2023/07/247907_0.jpeg",
    text: "(من مواليد بيروت في 9 من ذي الحجة 1310 هـ /25 حزيران 1893م - توفي في 3 من ذي الحجة 1396 هـ / 25 نوفمبر 1976) كاتب ومؤرخ وشاعر وقومي سوري. كان والده تاجرًا دمشقيًا معروفًا. تنقل الزِّرِكْلي في عدد من البلاد العربية بين دمشق ومكة المكرّمة والرياض والمدينة المنورة وعمّان وبيروت والقاهرة، وغيرها. لقد كان شاعراً يهاجم الاستعمار الفرنسي بشعره البديع، ويتعاون مع المجاهدين في مقاومة الفرنسيين، فما كان من الفرنسيين المستعمرين إلا أن يحكموا عليهِ بالإعدام أكثر من مرّة، وكان يفلت من أيديهم في كل مرة، ويهجوهم هجاءً مرّاً في شعره. عمل في السلك الدبلوماسي السعودي، وشغل منصب وزير مفوض ومندوب للسعودية في جامعة الدول العربية، وفي عام 1957م عُيّن سفيراً للسعودية في المملكة المغربية، وكان هذا آخر ما شغل من المناصب. أصدر للصحافة كلاً من صحيفة الحياة في القدس، صحيفة لسان العرب، مجلة الأصمعي، وصحيفة المُفيد في دمشق. وله في الطباعة والنشر المطبعة العربية التي أسسها في القاهرة، ومن أشهر مؤلفاته كتاب (الأعلام) وهو من أكبر كتب التراجم العربية في العصر الحديث، قضى في تأليفه وتجديده نحو 60 عاماً، إضافة إلى نحو 10 مؤلفات أخرى، منها (ديوان الزركلي) الذي جُمعت فيه قصائده ونُشرت بعد وفاته عام 1980م.",
  },
  {
    id: 5,
    title: "محمد البزم",
    image:
      "https://najoon.org/maarri/wp-content/uploads/2022/11/%D9%85%D8%AD%D9%85%D8%AF-%D8%A7%D9%84%D8%A8%D8%B2%D9%85.jpeg",
    text: "لد محمد بن محمود بن سليم البزم سنة 1887م في (حي الشاغور) أحد أحياء دمشق. تعلم مبادئ القراءة والكتابة في أحد الكتاتيب، ثم أقبل وقد تجاوز العشرين، على الأخذ عن بعض العلماء كالشيخ عبد القادر بدران وجمال الدين القاسمي، وصار يتردد مع صديقه خير الدين الزركلي على المكتبة الظاهرية، فأخذ يطالع بعض ما فيها من كتب الأدب والتاريخ والاجتماع والفنون، وحفظ الكثير من شعر كبار الشعراء، وأحبَّ اللغة العربية واستهواه نثرها وشعرها، وعشق الفصحى ولم يسمعه أحد يتحدث إلَّا بها سواء بين الخاصة أو العامة، وحُبّب إليه النحو فحفظ الألفية وغيرها من المتون، وقرأ كتب النحو ونقدَها وعلَّق عليها. وفي سنة 1913م انتدبه الأستاذ كامل القصاب ليدرّس فنون البلاغة والإنشاء في (المدرسة الكاملية). وفي سنة 1914م التحق بالجندية وعمل كاتبًا في أحد المصحَّات. وفي سنة 1924م عُين معلمًا في (مدرسة السمانة) بدمشق، ثم في سنة 1926م أستاذًا للعربية في (مكتب عنبر) و(ثانوية التجهيز الأولى) و(دار المعلمين العليا). وظلَّ يمارس مهنة التدريس حتى إحالته على التقاعد سنة 1953م. ولم يستطع البزم طوال عمله في التـدريس أن يتخلى عن صفتين غلبتا عليه: كونه نحويًّا وكونه شاعرًا، فكان لا يُغفل شاهدًا يساعده على إظهار تعمقه في النحو إلا حرص على إيراده، ولم يكن يدع مناسبة للاستشهاد بشعر من الشعراء القدامى أو بشعره إلا أملى ذلك على طلابه. توفي الأستاذ محمد البزم في 25 المحرم 1375هـ الموافق 12 أيلول 1955م، ودفن في دمشق.",
  },
  {
    id: 6,
    title: "شفيق الكمالي",
    image: "https://www.almoajam.org/photos/poet/1398.jpg",
    text: "شفيق بن عبد الجبار بن قدوري الكمالي (1929 - 1984) شاعر وسياسي بعثي عراقي. أصله من عانة، ولد في مدينة البوكمال السورية، على الحدود مع العراق، وعاش هناك سنينه الأولى ثم انتقل إلى بغداد حيث أكمل دراسته الابتدائية فالثانوية هناك، وتخرج من كلية الآداب في جامعة بغداد، ثم انتقل إلى القاهرة حيث حصل على درجة الماجستير من كلية الآداب في جامعة القاهرة. وبسبب نشاطه السياسي المناهض للنظام الملكي في العراق، فُصل من عمله وسُجن حتى إعلان الجمهورية العراقية. وبسبب خلافات سياسية تنقّل بعد ذلك بين سوريا ومصر، وبعد تولّي حزب البعث العراقي السلطة عاد وعُيّن في وزارة الإرشاد. تولّى عدد من المناصب الوزارية في العراق مثل وزارة الإعلام ووزارة الشباب، وترأس إتحادات أدبية على مستوى العراق والعالم العربي وأسّس دار «آفاق عربية». وتوفي في عام 1984 في العراق",
  },
  {
    id: 7,
    title: "فاطمة بديوي",
    image:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSfGPe-YCKw78Lhy9VTYQnfE3U7P6O8SRuoMw&s",
    text: "ولدت فاطمة أحمد بديوي السباعي 30 ديسمبر 1929 أو 1932/ 29 رجب 1348 في حماة. عانت اليتم وهي بعد طفلة، فتولى أخوها الأكبر الإشراف على تربيتها وتثقيفها، فكان يزودها بأمهات الكتب والمصادر ودواوين الشعراء. حرمت من إكمال تعليمها خضوعًا لتقاليد المجتمع، ولكنها حققت حظًا من التحصيل العلمي. افتتحت مدرسة خاصة عام 1955 في حمص عرفت بـحضانة روضة الأطفال، وتولت إدارتها، وأسست المسرح المدرسي في 1956 إضافة إلى تأسيسها لأول فرقة للرقص (فرقة السماح والفنون الأندلسية والشعبية) والتي اعتبرت الفرقة الأولى لهذا الفن في سوريا. شاركت في العديد من المهرجانات واللقاءات التلفزيونية والإذاعية داخل سوريا وخارجها. ونالت عدة جوائز على نشاطها المسرحي. انتسبت إلى جمعية الشعر باتحاد الكتاب العرب في 1982. توفيت فاطمة بديوي في يوم 20 يونيو 2007/ 5 جمادى الآخرة 1428 في حمص.",
  },

  /*   {
    id: 8,
    title: "احمد شوقي",
    image:
      "https://i.pinimg.com/originals/c0/91/dd/c091dd3b31599aa35b85570736913e5d.png",
  },

  {
    id: 9,
    title: "زكي قنصل",
    image: "https://kaafaat.com/storage/media/2326_rashf_zaky.gif",
  },
  {
    id: 10,
    title: "عبد الرحيم الحصني",
    image:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRm3XI_Pfe_Qs4UUSxbrogxU4O4HvaD69dFuw&s",
  },
  {
    id: 11,
    title: "محمد مهدي الجواهري",
    image: "https://i.ytimg.com/vi/LSCMhHjWJZM/hqdefault.jpg",
  },
  {
    id: 12,
    title: "ابو القاسم الشابي",
    image:
      "https://www.aljazeera.net/wp-content/uploads/2015/02/57dfb43e-e7f6-4b62-bac2-83406373e392.jpeg?resize=686%2C513&quality=80",
  },
  {
    id: 13,
    title: "ادونيس",
    image:
      "https://www.ithra.com/application/files/cache/thumbnails/c2cf5540c8bcb882c2892aecaa114733.png",
  },
  {
    id: 14,
    title: "عبدالله الردوني",
    image:
      "https://www.talmajd.net/wp-content/uploads/2016/12/abdalla-elbardone.jpg",
  }, */
];
